; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
(define (problem transport-90)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 v5 v6 v7 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 l13 l14 l15 l16 - location
    c0 c1 c2 c3 - size
    )
 (:init (capacity v1 c2)
    (capacity v2 c2)
    (capacity v3 c3)
    (capacity v4 c1)
    (capacity v5 c2)
    (capacity v6 c2)
    (capacity v7 c1)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (capacity-predecessor c2 c3)
    (at p1 l13)
    (at p2 l4)
    (at p3 l12)
    (at p4 l4)
    (at p5 l6)
    (at p6 l8)
    (at p7 l15)
    (at p8 l16)
    (at p9 l7)
    (at p10 l8)
    (at p11 l2)
    (at p12 l6)
    (at p13 l15)
    (at p14 l7)
    (at p15 l14)
    (at p16 l3)
    (at v1 l1)
    (at v2 l16)
    (at v3 l9)
    (at v4 l14)
    (at v5 l3)
    (at v6 l5)
    (at v7 l3)
    (road l12 l1)
    (road l12 l7)
    (road l6 l15)
    (road l4 l9)
    (road l3 l10)
    (road l11 l2)
    (road l10 l3)
    (road l2 l11)
    (road l1 l12)
    (road l14 l3)
    (road l5 l3)
    (road l14 l12)
    (road l9 l4)
    (road l9 l16)
    (road l8 l14)
    (road l16 l9)
    (road l15 l7)
    (road l13 l10)
    (road l7 l12)
    (road l7 l15)
    (road l12 l11)
    (road l4 l1)
    (road l3 l5)
    (road l12 l14)
    (road l14 l8)
    (road l3 l14)
    (road l1 l4)
    (road l10 l13)
    (road l11 l12)
    (road l15 l6)
    (road l4 l11)
    (road l11 l4)
    (road l13 l14)
    (road l14 l13)
    (road l7 l8)
    (road l8 l7)
    (road l3 l15)
    (road l15 l3)
    (road l11 l14)
    (road l14 l11)
    (road l2 l16)
    (road l16 l2)
    (road l2 l12)
    (road l12 l2)
    (road l7 l13)
    (road l13 l7)
    (road l1 l6)
    (road l6 l1)
    )
 (:goal (and 
(at p1 l4)
))
)

; plan
1. (drive v4 l14 l13)
   deleted: (at v4 l14)
   added: (at v4 l13)
   goals met: 0 of 1
2. (pick-up v4 l13 p1 c0 c1)
   deleted: (at p1 l13) (capacity v4 c1)
   added: (in p1 v4) (capacity v4 c0)
   goals met: 0 of 1
3. (drive v4 l13 l14)
   deleted: (at v4 l13)
   added: (at v4 l14)
   goals met: 0 of 1
4. (drive v4 l14 l11)
   deleted: (at v4 l14)
   added: (at v4 l11)
   goals met: 0 of 1
5. (drive v4 l11 l4)
   deleted: (at v4 l11)
   added: (at v4 l4)
   goals met: 0 of 1
6. (drop v4 l4 p1 c0 c1)
   deleted: (in p1 v4) (capacity v4 c0)
   added: (at p1 l4) (capacity v4 c1)
   goals met: 1 of 1
